protogia/avr-descriptionfiles-4-nim/svd/ATmega64RFR2.atdf.svd
        <register>
          <name>PCMSK2</name>
          <description>Pin Change Mask Register 2</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Mask</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>FLASH Controller</description>
      <baseAddress>0x00000067</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BGCR</name>
          <description>Reference Voltage Calibration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BGCAL</name>
              <description>Coarse Calibration Bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETTING_FOR_HIGHEST_VOLTAGE</name>
                  <description>Setting for highest voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_STEP_UP</name>
                  <description>Voltage step up</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CENTER_VALUE</name>
                  <description>Center value</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_STEP_DOWN</name>
                  <description>Voltage step down</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTING_FOR_LOWEST_VOLTAGE</name>
                  <description>Setting for lowest voltage</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGCAL_FINE</name>
              <description>Fine Calibration Bits</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CENTER_VALUE</name>
                  <description>Center value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_STEP_UP</name>
                  <description>Voltage step up</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTING_FOR_HIGHEST_VOLTAGE</name>
                  <description>Setting for highest voltage</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLTAGE_STEP_DOWN</name>
                  <description>Voltage step down</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETTING_FOR_LOWEST_VOLTAGE</name>
                  <description>Setting for lowest voltage</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NEMCR</name>
          <description>Flash Extended-Mode Control-Register</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AEAM</name>
              <description>Address for Extended Address Mode of Extra Rows</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FACTORY_ROW</name>
                  <description>Factory Row</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_ROW_1</name>
                  <description>User Row 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_ROW_2</name>
                  <description>User Row 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_ROW_3</name>
                  <description>User Row 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENEAM</name>
              <description>Enable Extended Address Mode for Extra Rows</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
